#include <iostream>
#include <map>
#include <windows.h>
using namespace std;
int main()
{
    const map <string, int> mp{
        {"Алчевськ",1196},
        {"Бердянськ",1093},
        {"Біла Церква",466},
        {"Вінниця",288},
        {"Горлівка",1091},
        {"Дніпро",824},
        {"Донецьк",1088},
        {"Євпаторія",1095},
        {"Єнакієве",1121},
        {"Житомир",391},
        {"Запоріжжя",887},
        {"Івано-Франківськ",808},
        {"Кам'янське",1173},
        {"Керч",541},
        {"Київ",1070},
        {"Краматорськ",722},
        {"Кременчук",705},
        {"Кривий Ріг",579},
        {"Кропивницький",1141},
        {"Лисичанськ",1218},
        {"Луганськ",337},
        {"Луцьк",277},
        {"Львів",1142},
        {"Макіївка",1122},
        {"Маріуполь",1020},
        {"Мелітополь",809},
        {"Миколаїв",811},
        {"Нікополь",684},
        {"Одеса",901},
        {"Павлоград",891},
        {"Полтава",322},
        {"Рівне",1182},
        {"Севастополь",1156},
        {"Сєвєродонецьк",1105},
        {"Сімферополь",1103},
        {"Слов'янськ",878},
        {"Суми",172},
        {"Тернопіль",412},
        {"Ужгород",1028},
        {"Харків",934},
        {"Хмельницький",188},
        {"Хрустальний",1214},
        {"Черкаси",600},
        {"Чернігів",686},
    };

    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    string city;
    cout << "Введіть місто --> " << endl;
    cin >> city;
    try
    {
        cout << "Відстань від Чернівців до " << city << " : " << mp.at(city) << " km" << endl;
    }
    catch (...)
    {
        cout << "Такого міста немає або хибний ввід!" << endl;
    }
}
